Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions along with the new scale to set on the Y axis and the sequence will be scaled by this amount. A scale of 1 indicates no scaling (1:1), smaller values will scale down (0.5, for example, will half the width of the sequence), larger values will scale up and negative values will flip the sequence about its origin and scale it unless the value used is exactly -1 (in which case the sequence is just flipped about its origin with no scaling).
zh_cn: 你提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，并在Y轴上设置新的比例，序列将按此比例缩放。1表示不进行缩放(1:1)，较小的值将按比例缩小(例如，0.5将是序列宽度的一半)，较大的值将按比例扩大，负值将按原点翻转序列并缩放它，除非使用的值正好是-1(在这种情况下，序列只是按原点翻转而没有缩放)。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions and the function will pause the sequence until you begin playback again using the function layer_sequence_play().
zh_cn: 你提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，此函数将暂停序列，直到你使用layer_sequence_play()函数再次开始播放。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions and the function will play the sequence, which you can then pause if required using the function layer_sequence_pause().
zh_cn: 你提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，此函数将播放序列，然后你可以在需要时使用layer_sequence_pause()函数暂停序列。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions and the sequence will be destroyed.
zh_cn: 您提供由layer_sequence_create()或其中一个layer element函数返回的序列元素ID，序列将被销毁。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions and then a speed scale value.
zh_cn: 您可以提供由layer_sequence_create()或其中一个层元素函数返回的序列元素ID，然后是速度缩放值。

source: You supply the sequence element ID as returned by layer_sequence_create() or by one of the layer element functions, and then give the playhead direction which should be one of the following constants:
zh_cn: 你提供由layer_sequence_create()或由一个层元素函数返回的序列元素ID，然后给出播放头方向，应该是以下常量之一:

source: You supply the sequence instance struct ID (as returned when the sequence instance was created in the room or by using one of the room layer functions - see here), as well as the object index (as defined in the asset browser) for the object that you want to override.
zh_cn: 您提供序列实例结构ID(当序列实例在房间中创建时返回，或者通过使用房间层函数之一返回—参见这里)，以及您想要覆盖的对象的对象索引(在资源浏览器中定义)。

source: You supply the server type, then give it a port to use, and finally the number of maximum connections that should be permitted at any one time to the server (note that this number is up to you, but too many connected clients will saturate the network or the device CPU won't be able to handle the processing of that number of players, so use with care).
zh_cn: 你提供服务器类型，然后给它一个使用的端口，最后是在任何时候允许服务器的最大连接数(注意，这个数字取决于你，但太多连接的客户端会使网络饱和，或者设备CPU将无法处理这么多玩家的处理，所以使用时要小心)。

source: You supply the skeleton animation name (as a string, as defined in the program used to make the animation, or as returned by using the function skeleton_animation_get, and the function returns the frames that it has as an integer value.
zh_cn: 您提供骨架动画名称(作为字符串，如用于制作动画的程序中定义的那样，或通过使用函数skeleton on_animation_get返回的那样，此函数返回作为整数值的帧。

source: You supply the slot name (a string) and the function will return an integer value for the colour.
zh_cn: 您提供槽名(一个字符串),函数将返回颜色的整数值。

source: You supply the slot name (a string) and the function will return an real value for the alpha between 0 and 1.
zh_cn: 您提供插槽名称(一个字符串),函数将返回一个介于0和1之间的alpha的实数值。

source: You supply the sprite ID (which you get when you create the sprite using layer_sprite_create() or when you use the layer ID along with layer_get_sprite_id()) and this will remove it.
zh_cn: 你提供精灵ID(当你使用layer_sprite_create()创建精灵时，或者当你使用layer_get_sprite_id()时，你会得到它)，这将删除它。

source: You supply the sprite index (as defined when creating the sprite resource) and the texture page it is assigned to will be removed from texture memory.
zh_cn: 你提供了精灵索引(创建精灵资源时定义的),它被分配到的纹理页面将从纹理内存中移除。

source: You supply the sprite index and the Nine Slice struct to apply, which can be retrieved using sprite_nineslice_create() or sprite_get_nineslice().
zh_cn: 您提供sprite索引和要应用的九宫格结构，可以使用sprite_nineslice_create()或sprite_get_nineslice()来检索它们。

source: You supply the sprite index and the mode to use, which should be one of the following constants:
zh_cn: 您需要提供精灵索引和要使用的模式，它应该是下列常量之一:

source: You supply the sprite index as defined when you created the sprite asset, and the texture page it is on will be loaded into memory.
zh_cn: 您提供了创建sprite资源时定义的sprite索引，它所在的纹理页面将被加载到内存中。

source: You supply the sprite index of the sprite to check, and the function will return one of the constants shown below.
zh_cn: 您提供要检查的精灵的精灵索引，此函数将返回如下所示的常量之一。

source: You supply the sprite index to use and then the left, top, right and bottom values for the bounding box positions.
zh_cn: 您提供要使用的精灵索引，然后提供边界框位置的左、上、右和下值。

source: You supply the sprite indices as an array and the texture pages they are assigned to will be removed from texture memory.
zh_cn: 你以数组的形式提供精灵索引，它们被分配到的纹理页面将从纹理内存中移除。

source: You supply the string to parse, and the function will return the top level array or struct which can then be checked in your code.
zh_cn: 您提供要解析的字符串，函数将返回顶级数组或结构，然后可以在代码中进行检查。

source: You supply the struct ID to check, and the function will return an integer value for the number of variables encountered, or (if no struct of the given ID exists) -1.
zh_cn: 您提供要检查的结构ID，函数将返回遇到的变量数量的整数值，或者(如果给定ID的结构不存在)-1。

source: You supply the struct ID to remove the variable from and the string name of the variable to be removed.
zh_cn: 您提供要从中删除变量的结构ID和要删除的变量的字符串名称。

source: You supply the struct pointer for the channel (as returned by the function animcurve_get_channel(), or as returned in the animation curve struct from the function animcurve_get()) and the "x" (time) position along the curve channel to evaluate.
zh_cn: 为通道提供结构指针(由函数animcurve_get_channel()返回，或由函数animcurve_get()在动画曲线结构中返回)和曲线通道沿线的"x"(时间)位置进行计算。

source: You supply the struct reference as well as the name of the variable to get the value of as a string (see example code below).
zh_cn: 您提供结构引用以及变量名，以获得字符串形式的值(参见下面的示例代码)。

source: You supply the struct reference as well as the name of the variable to set the value of as a string (see example code below), and then finally the value to set (can be any valid data type).
zh_cn: 您提供结构引用以及要设置为字符串的变量名(参见下面的示例代码)，最后是要设置的值(可以是任何有效的数据类型)。

source: You supply the struct reference to use as well as the variable name to check for as a string (see example code below).
zh_cn: 您提供要使用的结构引用以及要作为字符串检查的变量名(参见下面的示例代码)。

source: You supply the texture group ID string (as defined in the Texture Group Editor), and the function will return a 1D array, where each entry in the array is a single texture page ID.
zh_cn: 你提供纹理组ID字符串(在纹理组编辑器中定义)，函数将返回一个1D数组，其中数组中的每个条目都是单个纹理页面ID。

source: You supply the texture group ID string (as defined in the texture Group Editor) and (optionally) specify whether you want to also prefetch the pages in the group (load them into GPU memory)..
zh_cn: 你提供纹理组ID字符串(在纹理组编辑器中定义)，并(可选)指定你是否也想在组中预取页面(将它们加载到GPU内存中)。

source: You supply the texture group ID string (as defined in the texture Group Editor) and the function will return a 1D array where each entry contains the font index for a font resource.
zh_cn: 你提供纹理组ID字符串(在纹理组编辑器中定义)，函数将返回一个1D数组，其中每个条目包含字体资源的字体索引。

source: You supply the texture group ID string (as defined in the texture Group Editor) and the function will return a 1D array where each entry contains the sprite index for a sprite resource.
zh_cn: 你提供纹理组ID字符串(在纹理组编辑器中定义)，函数将返回一个1D数组，其中每个条目包含一个精灵资源的精灵索引。

source: You supply the texture group ID string (as defined in the texture Group Editor) and the function will return a 1D array where each entry contains the tileset index for a tileset resource.
zh_cn: 你提供纹理组ID字符串(在纹理组编辑器中定义)，函数将返回一个1D数组，其中每个条目包含一个纹理组资源的索引。

source: You supply the texture group ID string (as defined in the texture Group Editor) and the function will return a value indicating the status.
zh_cn: 你提供纹理组ID字符串(在纹理组编辑器中定义)，函数将返回一个指示状态的值。

source: You supply the texture group ID string (as defined in the texture Group Editor) for the group to unload.
zh_cn: 你为要卸载的组提供纹理组ID字符串(在纹理组编辑器中定义)。

source: You supply the tile map ID (which you get when you create the tile map using layer_tilemap_create() or when you use the layer ID along with layer_get_tilemap_id()) and this will remove it.
zh_cn: 你提供瓷砖地图ID(当你使用layer_tilemap_create()创tile map时，或当你使用图层ID和layer_get_tilemap_id()时，你得到)，这将删除它。

source: You supply the transform matrix ID (as returned by the function matrix build()), as well as the x, y and z values for the vector to transform.
zh_cn: 您提供转换矩阵ID(由函数矩阵build()返回)，以及要转换的向量的x、y和z值。

source: You supply the unique ID value for the shader to get the name of and the function will return the name of the resource as a string.
zh_cn: 你为着色器提供唯一的ID值来获取资源的名称，函数将以字符串的形式返回资源的名称。

source: You supply the unique element ID value (for example, as returned by the function that created the element or from the room editor) and the function will return the unique ID of the layer that the element is found on.
zh_cn: 您提供唯一的元素ID值(例如，由创建元素的函数或从room编辑器返回的值)，函数将返回元素所在层的唯一ID。

source: You supply the unique element ID value (for example, as returned the function that created the element or from the room editor) and the function will return one of the following constants (or -1 if the element does not exist or the ID value is erroneous):
zh_cn: 你提供唯一的元素ID值(例如，返回创建元素的函数或来自room编辑器)，函数将返回以下常量之一(或者-1，如果元素不存在或ID值错误):

source: You supply the unique instance ID value (which can be found from the Instance Properties in the room editor, or is returned when you call the function instance_create_layer()) as well as the name of the variable to get the value of as a string (see example code below).
zh_cn: 您提供唯一的实例ID值(可以从room编辑器中的instance Properties中找到，或者在调用instance_create_layer()函数时返回)以及变量名，以字符串的形式获取值(参见下面的示例代码)。

source: You supply the unique instance ID value (which can be found from the Instance Properties in the room editor, or is returned when you call the function instance_create_layer()) as well as the name of the variable to set the value of as a string (see example code below), and then finally the value to set (can be any valid data type).
zh_cn: 您提供唯一的实例ID值(可以从room编辑器中的instance Properties中找到，或者在调用instance_create_layer()函数时返回)，以及要设置值的变量名作为字符串(参见下面的示例代码)，最后是要设置的值(可以是任何有效的数据类型)。

source: You supply the unique instance ID value (which can be found from the Instance Properties in the room editor, or is returned when you call the function instance_create_layer()) as well as the variable name to check for as a string (see example code below).
zh_cn: 您提供唯一的实例ID值(可以从room编辑器中的instance Properties中找到，或者在调用instance_create_layer()函数时返回)以及要检查的变量名作为字符串(参见下面的示例代码)。

source: You supply the unique layer ID value and if the layer is one of the named layers created in the room editor, then the function will return a string with the layer name.
zh_cn: 您只需提供惟一的层ID值，如果该层是在room编辑器中创建的已命名层之一，则此函数将返回包含层名的字符串。

source: You supply the unique texture page ID (as returned by the texturegroup_* functions) or the texture group ID string (as defined in the Texture Group Editor), and the function will return true if they have been unpacked, or false otherwise.
zh_cn: 你提供唯一的纹理页面ID(由texturegroup_*函数返回)或纹理组ID字符串(在纹理组编辑器中定义)，如果它们已经解包，函数将返回true，否则返回false。

source: You supply the unique texture page ID (as returned by the texturegroup_* functions) to flush a single page, or you can supply a texture group name (as defined in the Texture Group Editor) to flush all the texture pages in the group.
zh_cn: 你可以提供唯一的纹理页面ID(由texturegroup_*函数返回)来刷新单个页面，或者你可以提供一个纹理组名称(在纹理组编辑器中定义)来刷新组中的所有纹理页面。

source: You supply the unique texture page ID (as returned by the texturegroup_* functions) to prefetch a single page, or you can supply a texture group name (as defined in the Texture Group Editor) to prefetch all the texture pages in the group.
zh_cn: 你可以提供唯一的纹理页面ID(由texturegroup_*函数返回)来预取单个页面，或者你可以提供一个纹理组名称(在纹理组编辑器中定义)来预取组中所有的纹理页面。

source: You supply the variable with the struct reference to check and the function will return either a string with the function name or undefined.
zh_cn: 为变量提供结构引用以进行检查，函数将返回带有函数名或未定义的字符串。

source: You supply the weak reference to check (as returned by the function weak_ref_create()), and the function will return true if the struct is still being referenced somewhere or false if it's not and has been garbage collected.
zh_cn: 您提供弱引用来检查(由函数weak_ref_create()返回)，如果该结构仍在某处被引用，则此函数将返回true，如果没有被引用且已被垃圾收集，则返回false。

source: You supply the x/y position of the center of the circular area to check along with the radius and the object to check for, and you can set the check to be precise (in which case all instances being checked will need to have precise collision masks) and whether the check should include the calling instance or not.
zh_cn: 您提供要检查的圆形区域中心的x/y位置以及半径和要检查的对象，并且您可以将检查设置为精确的(在这种情况下，所有被检查的实例都需要具有精确的碰撞遮罩)以及检查是否应该包括调用实例。

source: You supply the x/y position of the point to check and you can set the check to be precise (in which case all instances being checked will need to have precise collision masks) and whether the check should include the calling instance or not.
zh_cn: 您提供要检查的点的x/y位置，并且可以将检查设置为精确的(在这种情况下，所有被检查的实例都需要有精确的碰撞遮罩),以及检查是否应该包括调用实例。

source: You supply the x/y positions of the start and end of the line to check along with the object to check for, and you can set the check to be precise (in which case all instances being checked will need to have precise collision masks) and whether the check should include the calling instance or not.
zh_cn: 您提供要检查的线的起点和终点的x/y位置以及要检查的对象，并且您可以将检查设置为精确的(在这种情况下，所有被检查的实例都需要具有精确的碰撞遮罩),以及检查是否应该包括调用实例。

source: You supply the x/y positions of the top left and bottom right of the area to check along with the object to check for, and you can set the check to be precise (in which case all instances being checked will need to have precise collision masks) and whether the check should include the calling instance or not.
zh_cn: 您提供要检查的区域的左上和右下的x/y位置以及要检查的对象，并且您可以将检查设置为精确的(在这种情况下，所有被检查的实例都需要有精确的碰撞遮罩)以及检查是否应该包括调用实例。

source: You supply the x/y positions of the top left and bottom right of the elliptical area to check along with the object to check for, and you can set the check to be precise (in which case all instances being checked will need to have precise collision masks) and whether the check should include the calling instance or not.
zh_cn: 您提供要检查的椭圆区域的左上和右下的x/y位置以及要检查的对象，并且您可以将检查设置为精确的(在这种情况下，所有被检查的实例都需要有精确的碰撞遮罩)以及检查是否应该包括调用实例。

source: You supply the variable that holds the array, and the function will return the contents of last entry in the array.
zh_cn: 您提供保存数组的变量，函数将返回数组中最后一个条目的内容。

source: You tell the function the length of the array to create, and it will return the "handle" for the array which you can then assign to a variable.
zh_cn: 您告诉函数要创建的数组的长度，它将返回数组的"句柄",然后您可以将该句柄赋给一个变量。

source: You then pass it to this function with the data format (only buffer_u8 or buffer_s16 are currently supported), the sample rate (which can be between 1000hz and 48000hz), and an offset into the buffer to get the data from.
zh_cn: 然后将它传递给此函数，其中包含数据格式(目前仅支持buffer_u8或buffer_s16)、采样速率(可以在1000hz到48000hz之间)以及要从中获取数据的缓冲区偏移量。

source: You then supply the name of the channel, as a string, and the function will return the index value associated with that channel.
zh_cn: 然后以字符串形式提供通道的名称，函数将返回与该通道关联的索引值。

source: You use this function to allocate a portion of memory as a buffer in your game filled with the data from a previously created vertex buffer.
zh_cn: 您可以使用此函数来分配一部分内存作为游戏中的缓冲区，其中填充了以前创建的顶点缓冲区中的数据。

source: You use this function to allocate a portion of memory as a buffer in your game, with the function returning the unique buffer id that should be stored in a variable and used for all further function calls to the buffer.
zh_cn: 您可以使用此函数分配一部分内存作为游戏中的缓冲区，此函数返回唯一的缓冲区id，该id应该存储在一个变量中，并用于对该缓冲区的所有进一步的函数调用。

source: You will also need to supply a DS map of key/value pairs (as strings, where the key is the header field and the value is the required data for the header), and the final argument is an optional data string that you can add to the request, and if it's not needed then it can be either 0 or an empty string "".
zh_cn: 您还需要提供键/值对的DS map(作为字符串，其中键是报头字段，值是报头所需的数据)，最后的参数是可以添加到请求中的可选数据字符串，如果不需要它，那么它可以是0或空字符串""。

source: You would generally use this if you want to "save" the current GPU state (things like blend mode, alpha writing, culling, etc... will all be pushed to the stack), then draw something with different settings, and then reset the GPU stack to what it was before (by calling gpu_pop_state()).
zh_cn: 如果你想"保存"当前的GPU状态(比如混合模式、alpha写入、剔除等)，你通常会使用这个方法。都将被推到堆栈中)，然后用不同的设置绘制一些东西，然后重置GPU堆栈到它之前的样子(通过调用GPU pop_state())。

source: You would normally not need to use this variable as you should be setting instances to be added to discreet layers, which in turn are set to a specific depth, but it may be that you want to change the depth of an instance using this value, in which case a "temporary layer" will be created specifically for the instance at the given depth.
zh_cn: 通常不需要使用这个变量，因为您应该将实例添加到离散层中，而离散层又被设置为特定的深度，但是您可能希望使用这个值更改实例的深度，在这种情况下，将专门为具有给定深度的实例创建一个"临时层"。

source: You would normally use this function in conjunction with the gamepad_get_device_count() function to get the correct number of available game pads and/or gamepad "slots".
zh_cn: 您通常会将此函数与gamepad_get_device_count()函数结合使用，以获得可用游戏手柄和/或游戏手柄"插槽"的正确数量。

source: You would then define the necessary points for each vertex of the primitive before calling vertex_end() to finalise the primitive creation.
zh_cn: 然后，您将在调用 vertex_end() 以完成图元创建之前为图元的每个顶点定义必要的点。

source: You would then use this function to tell your instance which path to follow, what speed to follow the path (measured in pixels per step), how to behave when it reaches the end of the path, and whether to follow the absolute or relative path position.
zh_cn: 然后，您可以使用此函数告诉您的实例要沿着哪条路径前进，沿着该路径前进的速度是多少(以每步的像素为单位)，到达路径末端时的行为，以及是沿着绝对路径位置还是相对路径位置前进。

source: Your skeletal animation is made up of a number of "bones", which you will have defined and given names to in your animation program, and this function can be used to get certain data for the named bone at any time.
zh_cn: 您的骨骼动画由许多"骨骼"组成，您将在动画程序中定义这些骨骼并为其命名，此函数可用于随时获取已命名骨骼的某些数据。

source: Your skeletal animation is made up of a number of "bones", which you will have defined and given names to in your animation program, and this function can be used to set certain data for the named bone at any time.
zh_cn: 您的骨骼动画由许多"骨骼"组成，您将在动画程序中定义这些骨骼并为其命名，此函数可用于随时为命名的骨骼设置某些数据。

source: Your skeletal animation is made up of a number of "bones", which you will have defined and given names to in your animation program.
zh_cn: 您的骨骼动画由许多"骨骼"组成，您将在动画程序中定义并命名这些骨骼。

source: Zeroes or spaces will be inserted to match this.
zh_cn: 将插入零或空格来匹配它。

source: Zeros will be added to the right of the decimal point if the value given is less than the total and the number of decimal places to include.
zh_cn: 如果给定的值小于总数和要包含的小数位数，则将在小数点右侧添加零。

source: [Optional] The colour (RGB) to clear the gif to
zh_cn: [可选]清除gif的颜色(RGB)

source: [Optional] The offset along the X axis of the surface to add from
zh_cn: [可选]要添加的表面沿X轴的偏移

source: [Optional] The offset along the Y axis of the surface to add from
zh_cn: [可选]要添加的表面沿Y轴的偏移

source: [Optional] The quantization amount from 0 to 3 (0 lowest quality, 3 highest quality, default is 2)
zh_cn: [可选]从0到3的量化量(0表示最低质量，3表示最高质量，默认值为2)

source: a DS map with the information to encode (or an array)
zh_cn: 带有要编码信息的DS映射(或数组)

source: a null-terminated string argument
zh_cn: 一个以空结尾的字符串参数

source: add key on the numeric keypad
zh_cn: 数字键盘上的加法键

source: alt key
zh_cn: alt键

source: backspace key
zh_cn: 退格键

source: below)
zh_cn: 下图)

source: below).
zh_cn: 下图)

source: binormal values
zh_cn: 副法线值

source: c_white is to display it normally.
zh_cn: c_white 是默认显示。

source: colour values (r, g, b, a)
zh_cn: 颜色值 (r, g, b, a)

source: compile time constant of current build type either "exe" (for create executable) or "run" (for a run)
zh_cn: 当前构建类型的编译时间常量"exe"(用于创建可执行文件)或"run"(用于运行)

source: decimal dot keys on the numeric keypad
zh_cn: 数字键盘上的小数点键

source: defines the ratio of pixels on screen to metres in the real world.
zh_cn: 定义屏幕上的像素与现实世界中的米数之比。

source: delete key
zh_cn: 删除键

source: distance = clamp(listener_distance, reference_distance, maximum_distance) gain = ((distance / reference_distance) ^ (-falloff_factor)) * (((maximum_distance - distance) / (maximum_distance - reference_distance)) ^ (distance / maximum_distance))
zh_cn: 距离=夹逼(侦听器的距离，基准距离，最远距离) ,增益=(距离/基准距离)^(-衰减系数)*(((最远距离-距离)/(最远距离-基准距离)^(距离/最远距离))。distance = clamp(listener_distance, reference_distance, maximum_distance) gain = ((distance / reference_distance) ^ (-falloff_factor)) * (((maximum_distance - distance) / (maximum_distance - reference_distance)) ^ (distance / maximum_distance))

source: distance = clamp(listener_distance, reference_distance, maximum_distance) gain = (1 - falloff_factor * (distance - reference_distance) / (maximum_distance - reference_distance))
zh_cn: 距离=夹逼(侦听器的距离，基准距离，最远距离)增益=(1-衰减系数*(距离-基准距离)/(最远距离-基准距离) distance = clamp(listener_distance, reference_distance, maximum_distance) gain = (1 - falloff_factor * (distance - reference_distance) / (maximum_distance - reference_distance))

source: distance = clamp(listener_distance, reference_distance, maximum_distance) gain = (distance / reference_distance) ^ (-falloff_factor)
zh_cn: 距离=夹逼(侦听器的距离，基准距离，最远距离) ,增益=(距离/基准距离)^-衰减系数。distance = clamp(listener_distance, reference_distance, maximum_distance) gain = (distance / reference_distance) ^ (-falloff_factor)

source: distance = clamp(listener_distance, reference_distance, maximum_distance) gain = (reference_distance / (reference_distance + falloff_factor * (distance - reference_distance))) * (((maximum_distance - distance) / (maximum_distance - reference_distance)) ^ (distance / maximum_distance))
zh_cn: 距离=夹逼(侦听器的距离，基准距离，最远距离)增益 = (基准距离 / (基准距离 + 衰减系数 * (距离 - 基准距离))) * (((最远距离 - 距离) / (最远距离 - 基准距离)) ^ (距离 / 最远距离)) distance = clamp(listener_distance, reference_distance, maximum_distance) gain = (reference_distance / (reference_distance + falloff_factor * (distance - reference_distance))) * (((maximum_distance - distance) / (maximum_distance - reference_distance)) ^ (distance / maximum_distance))

source: distance = clamp(listener_distance, reference_distance, maximum_distance) gain = reference_distance / (reference_distance + falloff_factor * (distance - reference_distance))
zh_cn: 距离 = 夹逼(侦听器的距离, 基准距离, 最远距离) 增益 = 基准距离 / (基准距离 + 衰减系数 * *(距离-基准距离) distance = clamp(listener_distance, reference_distance, maximum_distance) gain = reference_distance / (reference_distance + falloff_factor * (distance - reference_distance))

source: distance = min(distance, maximum_distance) gain = (1 - falloff_factor * (distance - reference_distance) / (maximum_distance - reference_distance))
zh_cn: 距离=最小(距离, 最大距离)增益=(1-衰减系数*(距离-基准距离)/(最远距离-基准距离) distance = min(distance, maximum_distance) gain = (1 - falloff_factor * (distance - reference_distance) / (maximum_distance - reference_distance))

source: divide key on the numeric keypad
zh_cn: 数字键盘上的除法键

source: either of the control keys
zh_cn: 任何一个控制键(ctrl)

source: either of the shift keys
zh_cn: 任何一个换档键(shift)

source: enable (true) or disable (false) the garbage collector.
zh_cn: 启用(true)或禁用(false)垃圾收集器。

source: enable or disable all lighting (true or false)
zh_cn: 启用或禁用所有照明(true or false)

source: end key
zh_cn: 结束键(end)

source: end x position for the edge
zh_cn: 边缘的结束x位置

source: end y position for the edge
zh_cn: 边缘的结束y位置

source: enter key
zh_cn: 确认键
